CSI API ETABS v1
cAnalysisResultsSetup.GetOptionModeShape Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetOptionModeShape(
	ref int ModeShapeStart,
	ref int ModeShapeEnd,
	ref bool ModeShapesAll
)
Function GetOptionModeShape (
	ByRef ModeShapeStart As Integer,
	ByRef ModeShapeEnd As Integer,
	ByRef ModeShapesAll As Boolean
) As Integer
Dim instance As cAnalysisResultsSetup
Dim ModeShapeStart As Integer
Dim ModeShapeEnd As Integer
Dim ModeShapesAll As Boolean
Dim returnValue As Integer
returnValue = instance.GetOptionModeShape(ModeShapeStart,
	ModeShapeEnd, ModeShapesAll)
int GetOptionModeShape(
	int% ModeShapeStart,
	int% ModeShapeEnd,
	bool% ModeShapesAll
)
abstract GetOptionModeShape :
        ModeShapeStart : int byref *
        ModeShapeEnd : int byref *
        ModeShapesAll : bool byref -> int
Parameters
ModeShapeStart
Type: System.Int32
ModeShapeEnd
Type: System.Int32
ModeShapesAll
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cAnalysisResultsSetup Interface
ETABSv1 Namespace